app/views/books/index.html.erb

SELECT "books".* FROM "books"
---
         <% end %></td>
      <td>コメント数:<%= book.book_comments.count %></td>