app/controllers/books_controller.rb

 def create
   @book = Book.new(book_params)
   @books = Book.all
   @book.user_id = current_user.id
   if @book.save
---
SELECT "books".* FROM "books"
INSERT INTO "books" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "ofedi"], ["body", "2ohlojgh9hfq0blbx5jj"], ["created_at", "2021-06-01 06:36:15.222000"], ["updated_at", "2021-06-01 06:36:15.222000"], ["user_id", 2]]