app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
def show
 @book = Book.new
  @user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "7jljnqsum"], ["introduction", "r5t23sd2ll35y7kx26j"], ["updated_at", "2021-06-01 06:36:18.193601"], ["id", 2]]
---
 def update
    @user = User.find(params[:id])
    if  @user.update(user_params)